doc/org-mode/api.org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
#+STYLE: <LINK href="stylesheet_api.css" rel="stylesheet" type="text/css" />
#+TITLE: Nitrogen 2.x Documentation
#+AUTHOR: Rusty Klophaus (@rklophaus)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL:

#+TEXT: [[file:./index.org][Getting Started]] | API | [[file:./elements.org][Elements]] | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | [[file:./about.org][About]]
#+HTML: <div class=headline>Nitrogen API</div>

* Index

  + [[1][AJAX Updates]]
  + [[2][Convenience Functions]]
  + [[3][Event Wiring]]
  + [[4][Asynchronous Page Updates]]
  + [[5][Redirect]]
  + [[6][Session State]]
  + [[7][Page State]]
  + [[8][Authentication and Authorization]]
  + [[9][Web Request and Response]]
  + [[10][Cookies]]
  + [[11][HTTP Headers]]
  + [[12][Serialization]]
  + [[13][Logging]]
  + [[14][Configuration]]

* AJAX Updates
# <<1>>

  TargetID can refer to the name of an element, or it can be a JQuery
  selector path. See [[./paths.org][Element Paths]] for more information.
   
** wf:update(TargetID, Elements) -> ok
   Update the contents of TargetID with a new set of Nitrogen Elements.

** wf:replace(TargetID, Elements) -> ok
   Replace TargetID with a new set of Nitrogen Elements.

** wf:remove(TargetID) -> ok
   Remove TargetID from the DOM.
   
** wf:insert\_top(TargetID, Elements) -> ok
   Insert Nitrogen Elements at the top of TargetID, shifting the existing contents downward.
   
** wf:insert\_bottom(TargetID, Elements) -> ok
   Insert Nitrogen Elements at the bottom of the TargetID, below the existing contents.

** wf:flash(Elements) -> ok
   Insert the Nitrogen Elements as a new flash message.

* Convenience Functions
# <<2>>

** wf:f(Format, Data) -> String

   Convenience function to format a string similar to
   io\_lib:format(Format, Data). Returns a flattened list.
   
** wf:coalesce([List]) -> Item

   Return the first element in the list that is not 'undefined'.
   
** wf:is\_string(Term) -> Bool

   Return true if the Term is an Erlang string. That is, a flat list
   of integers.
   
** wf:to\_list(Term) -> List

   Convert the supplied term to a flat list, if possible. Useful for
   turning Integers, Atoms, Binaries into Strings.
   
** wf:to\_atom(Term) -> Atom

   Convert the supplied term into an Atom, if possible. Useful for
   turning Integers, Binaries, and Strings into Atoms.

** wf:to\_binary(Term) -> Binary

   Convert the supplied term into a Binary, if possible. Useful for
   turning Integers, Atoms, and Strings into Binaries.

** wf:to\_integer(Term) -> Integer

   Convert the supplied term into an Integer, if possible. Useful for turning Atoms, Strings, and Binaries into Integers.

** wf:html\_encode(String) -> EncodedString

   HTML encode the supplied String, converting things like < and > into &lt; and &gt;.

** wf:html\_decode(String) -> DecodedString

   HTML decoding decode the supplied String, converting things like &lt; and &gt; into < and >.

** wf:url\_encode(String) -> EncodedString

   URL encode the supplied String, converting potentially URL-breaking characters into percent notation (%XX).

** wf:url\_decode(String) -> DecodedString

   URL decode the supplied String, converting a percent-encoded String into a normal String.

** wf:hex\_encode(String) -> EncodedString.
  
   Hex-encode the supplied String.

** wf:hex\_decode(String) -> DecodedString

   Convert a hex-encoded String to a normal String.

** wf:temp\_id() -> String

   Return a temp id. Useful for naming an Element so that you can
   refer to it during a postback later, without giving it a specific
   name.

** wf:js\_escape(String) -> EscapedString

   Convert a String to a JS-safe string by adding backslashes to quotes and newlines.

* Event Wiring
# <<3>>
   
** wf:wire(Actions) -> ok

   Wire actions to the page. The Actions are applied against the entire page unless a
   trigger or target are specified within the action itself.

   For example, show a Javascript alert:

#+BEGIN_SRC erlang
   wf:wire(#alert { text=\"Hello, World!\" })
#+END_SRC
   
** wf:wire(TargetID, Actions) -> ok

   Wire actions to the page, targeted against supplied TargetID.
   For example, hide a Panel:

#+BEGIN_SRC erlang
   wf:wire(PanelID, #hide {})
#+END_SRC

