doc/html/api.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Nitrogen 2.x Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-12-20 17:14:34 EST"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
<LINK href="stylesheet_api.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">

<h1 class="title">Nitrogen 2.x Documentation</h1>

<p><a href="./index.html">Getting Started</a> | API | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./about.html">About</a>
</p>


<div class=headline>Nitrogen API</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Index </a></li>
<li><a href="#sec-2">2 AJAX Updates </a></li>
<li><a href="#sec-3">3 Convenience Functions </a></li>
<li><a href="#sec-4">4 Event Wiring </a></li>
<li><a href="#sec-5">5 Asynchronous Page Updates (Comet, Continuations) </a></li>
<li><a href="#sec-6">6 Redirect </a></li>
<li><a href="#sec-7">7 Session State </a></li>
<li><a href="#sec-8">8 Page State </a></li>
<li><a href="#sec-9">9 Authentication and Authorization </a></li>
<li><a href="#sec-10">10 Web Request and Response </a></li>
<li><a href="#sec-11">11 Cookies </a></li>
<li><a href="#sec-12">12 HTTP Headers </a></li>
<li><a href="#sec-13">13 Serialization </a></li>
<li><a href="#sec-14">14 Logging </a></li>
<li><a href="#sec-15">15 Configuration </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Index </h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
<a href="#sec-2">AJAX Updates</a>
</li>
<li>
<a href="#sec-3">Convenience Functions</a>
</li>
<li>
<a href="#sec-4">Event Wiring</a>
</li>
<li>
<a href="#sec-5">Asynchronous Page Updates</a>
</li>
<li>
<a href="#sec-6">Redirect</a>
</li>
<li>
<a href="#sec-7">Session State</a>
</li>
<li>
<a href="#sec-8">Page State</a>
</li>
<li>
<a href="#sec-9">Authentication and Authorization</a>
</li>
<li>
<a href="#sec-10">Web Request and Response</a>
</li>
<li>
<a href="#sec-11">Cookies</a>
</li>
<li>
<a href="#sec-12">HTTP Headers</a>
</li>
<li>
<a href="#sec-13">Serialization</a>
</li>
<li>
<a href="#sec-14">Logging</a>
</li>
<li>
<a href="#sec-15">Configuration</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><a name="1" id="1"></a><span class="section-number-2">2</span> AJAX Updates </h2>
<div class="outline-text-2" id="text-2">


<p>
TargetID can refer to the name of an element, or it can be a JQuery
selector path. See <a href="./paths.html">Element Paths</a> for more information.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> wf:update(TargetID, Elements) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_1">

<p>Update the contents of TargetID with a new set of Nitrogen Elements.
</p>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> wf:replace(TargetID, Elements) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_2">

<p>Replace TargetID with a new set of Nitrogen Elements.
</p>
</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> wf:remove(TargetID) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_3">

<p>Remove TargetID from the DOM.
</p>
</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> wf:insert_top(TargetID, Elements) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_4">

<p>Insert Nitrogen Elements at the top of TargetID, shifting the existing contents downward.
</p>
</div>

</div>

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> wf:insert_bottom(TargetID, Elements) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_5">

<p>Insert Nitrogen Elements at the bottom of the TargetID, below the existing contents.
</p>
</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3">2.6</span> wf:flash(Elements) -&gt; ok </h3>
<div class="outline-text-3" id="text-2_6">

<p>Insert the Nitrogen Elements as a new flash message.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><a name="2" id="2"></a><span class="section-number-2">3</span> Convenience Functions </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> wf:f(Format, Data) -&gt; String </h3>
<div class="outline-text-3" id="text-3_1">


<p>
Convenience function to format a string similar to
io_lib:format(Format, Data). Returns a flattened list.
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> wf:coalesce([List]) -&gt; Item </h3>
<div class="outline-text-3" id="text-3_2">


<p>
Return the first element in the list that is not 'undefined'.
</p>
</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> wf:is_string(Term) -&gt; Bool </h3>
<div class="outline-text-3" id="text-3_3">


<p>
Return true if the Term is an Erlang string. That is, a flat list
of integers.
</p>
</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> wf:to_list(Term) -&gt; List </h3>
<div class="outline-text-3" id="text-3_4">


<p>
Convert the supplied term to a flat list, if possible. Useful for
turning Integers, Atoms, Binaries into Strings.
</p>
</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> wf:to_atom(Term) -&gt; Atom </h3>
<div class="outline-text-3" id="text-3_5">


<p>
Convert the supplied term into an Atom, if possible. Useful for
turning Integers, Binaries, and Strings into Atoms.
</p>
</div>

</div>

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3">3.6</span> wf:to_binary(Term) -&gt; Binary </h3>
<div class="outline-text-3" id="text-3_6">


<p>
Convert the supplied term into a Binary, if possible. Useful for
turning Integers, Atoms, and Strings into Binaries.
</p>
</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3">3.7</span> wf:to_integer(Term) -&gt; Integer </h3>
<div class="outline-text-3" id="text-3_7">


<p>
Convert the supplied term into an Integer, if possible. Useful for turning Atoms, Strings, and Binaries into Integers.
</p>
</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3">3.8</span> wf:html_encode(String) -&gt; EncodedString </h3>
<div class="outline-text-3" id="text-3_8">


<p>
HTML encode the supplied String, converting things like &lt; and &gt; into &amp;lt; and &amp;gt;.
</p>
</div>

</div>

<div id="outline-container-3_9" class="outline-3">
<h3 id="sec-3_9"><span class="section-number-3">3.9</span> wf:html_decode(String) -&gt; DecodedString </h3>
<div class="outline-text-3" id="text-3_9">


<p>
HTML decoding decode the supplied String, converting things like &amp;lt; and &amp;gt; into &lt; and &gt;.
</p>
</div>

</div>

<div id="outline-container-3_10" class="outline-3">
<h3 id="sec-3_10"><span class="section-number-3">3.10</span> wf:url_encode(String) -&gt; EncodedString </h3>
<div class="outline-text-3" id="text-3_10">


<p>
URL encode the supplied String, converting potentially URL-breaking characters into percent notation (%XX).
</p>
</div>

</div>

<div id="outline-container-3_11" class="outline-3">
<h3 id="sec-3_11"><span class="section-number-3">3.11</span> wf:url_decode(String) -&gt; DecodedString </h3>
<div class="outline-text-3" id="text-3_11">


<p>
URL decode the supplied String, converting a percent-encoded String into a normal String.
</p>
</div>

</div>

<div id="outline-container-3_12" class="outline-3">
<h3 id="sec-3_12"><span class="section-number-3">3.12</span> wf:hex_encode(String) -&gt; EncodedString. </h3>
<div class="outline-text-3" id="text-3_12">


<p>
Hex-encode the supplied String.
</p>
</div>

</div>

<div id="outline-container-3_13" class="outline-3">
<h3 id="sec-3_13"><span class="section-number-3">3.13</span> wf:hex_decode(String) -&gt; DecodedString </h3>
<div class="outline-text-3" id="text-3_13">


<p>
Convert a hex-encoded String to a normal String.
</p>
</div>

</div>

<div id="outline-container-3_14" class="outline-3">
<h3 id="sec-3_14"><span class="section-number-3">3.14</span> wf:temp_id() -&gt; String </h3>
<div class="outline-text-3" id="text-3_14">


<p>
Return a temp id. Useful for naming an Element so that you can
refer to it during a postback later, without giving it a specific
name.
</p>
</div>

</div>

<div id="outline-container-3_15" class="outline-3">
<h3 id="sec-3_15"><span class="section-number-3">3.15</span> wf:js_escape(String) -&gt; EscapedString </h3>
<div class="outline-text-3" id="text-3_15">


<p>
Convert a String to a JS-safe string by adding backslashes to quotes and newlines.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><a name="3" id="3"></a><span class="section-number-2">4</span> Event Wiring </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> wf:wire(Actions) -&gt; ok </h3>
<div class="outline-text-3" id="text-4_1">


<p>
Wire actions to the page. The Actions are applied against the entire page unless a
trigger or target are specified within the action itself.
</p>
<p>
For example, show a Javascript alert:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(#<span style="color: #28439B;">alert</span> { text=\"<span style="color: #000000;">Hello</span>, <span style="color: #000000;">World</span>!\" })
</pre>



</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> wf:wire(TargetID, Actions) -&gt; ok </h3>
<div class="outline-text-3" id="text-4_2">


<p>
Wire actions to the page, targeted against supplied TargetID.
For example, hide a Panel:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">PanelID</span>, #<span style="color: #28439B;">hide</span> {})
</pre>



</div>

</div>
