doc/org-mode/api.org
** wf:wire(TriggerID, TargetID, Actions) -> ok

   Wire actions to the page, triggering on the supplied TriggerID and targeting against
   the supplied TargetID. This allows you to wire actions (such as #event) that listen
   to a click on one element and modify a different element.

   For example, when a button is clicked, hide a panel:

#+BEGIN_SRC erlang
   wf:wire(ButtonID, PanelID, #event { type=click, actions=#hide {} })
#+END_SRC

** wf:continue(Tag, Function, IntervalInMS, TimeoutInMS) -> ok

   Spawn the provided function (arity 0) and tell the browser to poll for the results at the specified interval, with a timeout setting.
   See [[http://nitrogenproject.com/web/samples/continuations][continuations example]] for usage.

* Asynchronous Page Updates (Comet, Continuations)
# <<4>>

** wf:comet(Function) -> Pid

   Spawn a comet function, and tell the browser to open a COMET request to receive the results in real time.
   See [[http://nitrogenproject.com/web/samples/comet1][example 1]], [[http://nitrogenproject.com/web/samples/comet2][example 2]], and [[http://nitrogenproject.com/web/samples/comet3][example 3]] for usage.

** wf:comet(Function, LocalPool) -> Pid

   Spawn a function connected to the specified local pool.

** wf:comet_global(Function, GlobalPool) -> Pid

   Spawn a function connected to the specified global pool.

** wf:send(LocalPool, Message)

   Send the specified message to all comet functions connected to the
   specified local pool.

** wf:send\_global(GlobalPool, Message)

   Send the specified message to all comet function connected to the
   specified GlobalPool.
   
** wf:flush() -> ok

   Normally, the results of a comet function are sent to the browser when the function exits.
   comet\_flush/0 pushes results to the browser immediately, useful for a looping comet function.

** wf:async\_mode()

   Return the current async mode, either =comet= or ={poll, IntervalInMS}=.

** wf:async\_mode(Mode)

   Set the current async mode, either =comet= or ={poll, IntervalInMS}=.

** wf:switch\_to\_comet()

   Run all current and future async processes in comet mode. This uses more
   resources on the server, as HTTP connections stay open.

** wf:switch\_to\_polling(IntervalInMS)

   Run all current and future async processes in polling mode. This
   uses more resources on the client, as the application must issue a
   request every =IntervalInMS= milliseconds.

** wf:continue(Tag, Function) -> ok

   Spawn the provided function (arity 0) and tell the browser to poll for the results.
   See [[http://nitrogenproject.com/web/samples/continuations][continuations example]] for usage.
   
** wf:continue(Tag, Function, Interval) -> ok

   Spawn the provided function (arity 0) and tell the browser to poll for the results at the specified interval.
   See [[http://nitrogenproject.com/web/samples/continuations][continuations example]] for usage.

* Redirect
# <<5>>

** wf:redirect(Url) -> ok
   Redirect to the provided URL.
   
** wf:redirect\_to\_login(Url) -> ok

   Redirect to the provided URL, attaching a token on the end. The receiving page can call
   =wf:redirect\_from\_login(DefaultUrl)= to send the user back to the current page.
   
** wf:redirect\_from\_login(DefaultUrl) -> ok

   Redirect the user back to a page that called =wf:redirect\_to\_login(Url)=. If
   the user came to the page for some other reason, then the user is redirected to the
   provided DefaultUrl.

* Session State
# <<6>>

** wf:session(Key) -> Value or 'undefined'

   Retrieve the session value stored under the specified key.
   For example, retrieve the value of 'count' for the current user:
   =Count = wf:session(count)=

** wf:session\_default(Key, DefaultValue) -> Value.

   Retrieve the session value stored under a specific key. If not
   found, return the supplied default value.
   
** wf:session(Key, Value) -> ok
   
   Store a session variable for the current user. Key and Value can be any Erlang term.
   For example, store a count:
   =wf:session(count, Count)=
   
** wf:clear\_session() -> ok

   Clear the current user's session.
   
** wf:logout() -> ok
   Clear session state, page state, identity, and roles.

* Page State
# <<7>>
   
** wf:state(Key) -> Value

   Retrieve a page state value stored under the specified key. Page State is
   different from Session State in that Page State is scoped to a series
   of requests by one user to one Nitrogen Page.

** wf:state\_default(Key, DefaultValue) -> Value.

   Retrieve a page state value stored under the specified key. If the
   value is not set, then return the supplied default value.
   
** wf:state(Key, Value) -> ok

   Store a page state variable for the current user. Page State is
   different from Session State in that Page State is scoped to a series
   of requests by one user to one Nitrogen Page.
   
** wf:clear\_state() -> ok
   Clear a user's page state.

* Authentication and Authorization
# <<8>>
   
