doc/html/api.html

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> wf:wire(TriggerID, TargetID, Actions) -&gt; ok </h3>
<div class="outline-text-3" id="text-4_3">


<p>
Wire actions to the page, triggering on the supplied TriggerID and targeting against
the supplied TargetID. This allows you to wire actions (such as #event) that listen
to a click on one element and modify a different element.
</p>
<p>
For example, when a button is clicked, hide a panel:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">ButtonID</span>, <span style="color: #000000;">PanelID</span>, #<span style="color: #28439B;">event</span> { type=click, actions=#<span style="color: #28439B;">hide</span> {} })
</pre>



</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> wf:continue(Tag, Function, IntervalInMS, TimeoutInMS) -&gt; ok </h3>
<div class="outline-text-3" id="text-4_4">


<p>
Spawn the provided function (arity 0) and tell the browser to poll for the results at the specified interval, with a timeout setting.
See <a href="http://nitrogenproject.com/web/samples/continuations">continuations example</a> for usage.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name="4" id="4"></a><span class="section-number-2">5</span> Asynchronous Page Updates (Comet, Continuations) </h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> wf:comet(Function) -&gt; Pid </h3>
<div class="outline-text-3" id="text-5_1">


<p>
Spawn a comet function, and tell the browser to open a COMET request to receive the results in real time.
See <a href="http://nitrogenproject.com/web/samples/comet1">example 1</a>, <a href="http://nitrogenproject.com/web/samples/comet2">example 2</a>, and <a href="http://nitrogenproject.com/web/samples/comet3">example 3</a> for usage.
</p>
</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> wf:comet(Function, LocalPool) -&gt; Pid </h3>
<div class="outline-text-3" id="text-5_2">


<p>
Spawn a function connected to the specified local pool.
</p>
</div>

</div>

<div id="outline-container-5_3" class="outline-3">
<h3 id="sec-5_3"><span class="section-number-3">5.3</span> wf:comet<sub>global</sub>(Function, GlobalPool) -&gt; Pid </h3>
<div class="outline-text-3" id="text-5_3">


<p>
Spawn a function connected to the specified global pool.
</p>
</div>

</div>

<div id="outline-container-5_4" class="outline-3">
<h3 id="sec-5_4"><span class="section-number-3">5.4</span> wf:send(LocalPool, Message) </h3>
<div class="outline-text-3" id="text-5_4">


<p>
Send the specified message to all comet functions connected to the
specified local pool.
</p>
</div>

</div>

<div id="outline-container-5_5" class="outline-3">
<h3 id="sec-5_5"><span class="section-number-3">5.5</span> wf:send_global(GlobalPool, Message) </h3>
<div class="outline-text-3" id="text-5_5">


<p>
Send the specified message to all comet function connected to the
specified GlobalPool.
</p>
</div>

</div>

<div id="outline-container-5_6" class="outline-3">
<h3 id="sec-5_6"><span class="section-number-3">5.6</span> wf:flush() -&gt; ok </h3>
<div class="outline-text-3" id="text-5_6">


<p>
Normally, the results of a comet function are sent to the browser when the function exits.
comet_flush/0 pushes results to the browser immediately, useful for a looping comet function.
</p>
</div>

</div>

<div id="outline-container-5_7" class="outline-3">
<h3 id="sec-5_7"><span class="section-number-3">5.7</span> wf:async_mode() </h3>
<div class="outline-text-3" id="text-5_7">


<p>
Return the current async mode, either <code>comet</code> or <code>{poll, IntervalInMS}</code>.
</p>
</div>

</div>

<div id="outline-container-5_8" class="outline-3">
<h3 id="sec-5_8"><span class="section-number-3">5.8</span> wf:async_mode(Mode) </h3>
<div class="outline-text-3" id="text-5_8">


<p>
Set the current async mode, either <code>comet</code> or <code>{poll, IntervalInMS}</code>.
</p>
</div>

</div>

<div id="outline-container-5_9" class="outline-3">
<h3 id="sec-5_9"><span class="section-number-3">5.9</span> wf:switch_to_comet() </h3>
<div class="outline-text-3" id="text-5_9">


<p>
Run all current and future async processes in comet mode. This uses more
resources on the server, as HTTP connections stay open.
</p>
</div>

</div>

<div id="outline-container-5_10" class="outline-3">
<h3 id="sec-5_10"><span class="section-number-3">5.10</span> wf:switch_to_polling(IntervalInMS) </h3>
<div class="outline-text-3" id="text-5_10">


<p>
Run all current and future async processes in polling mode. This
uses more resources on the client, as the application must issue a
request every <code>IntervalInMS</code> milliseconds.
</p>
</div>

</div>

<div id="outline-container-5_11" class="outline-3">
<h3 id="sec-5_11"><span class="section-number-3">5.11</span> wf:continue(Tag, Function) -&gt; ok </h3>
<div class="outline-text-3" id="text-5_11">


<p>
Spawn the provided function (arity 0) and tell the browser to poll for the results.
See <a href="http://nitrogenproject.com/web/samples/continuations">continuations example</a> for usage.
</p>
</div>

</div>

<div id="outline-container-5_12" class="outline-3">
<h3 id="sec-5_12"><span class="section-number-3">5.12</span> wf:continue(Tag, Function, Interval) -&gt; ok </h3>
<div class="outline-text-3" id="text-5_12">


<p>
Spawn the provided function (arity 0) and tell the browser to poll for the results at the specified interval.
See <a href="http://nitrogenproject.com/web/samples/continuations">continuations example</a> for usage.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name="5" id="5"></a><span class="section-number-2">6</span> Redirect </h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> wf:redirect(Url) -&gt; ok </h3>
<div class="outline-text-3" id="text-6_1">

<p>Redirect to the provided URL.
</p>
</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> wf:redirect_to_login(Url) -&gt; ok </h3>
<div class="outline-text-3" id="text-6_2">


<p>
Redirect to the provided URL, attaching a token on the end. The receiving page can call
<code>wf:redirect_from_login(DefaultUrl)</code> to send the user back to the current page.
</p>
</div>

</div>

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> wf:redirect_from_login(DefaultUrl) -&gt; ok </h3>
<div class="outline-text-3" id="text-6_3">


<p>
Redirect the user back to a page that called <code>wf:redirect_to_login(Url)</code>. If
the user came to the page for some other reason, then the user is redirected to the
provided DefaultUrl.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><a name="6" id="6"></a><span class="section-number-2">7</span> Session State </h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> wf:session(Key) -&gt; Value or 'undefined' </h3>
<div class="outline-text-3" id="text-7_1">


<p>
Retrieve the session value stored under the specified key.
For example, retrieve the value of 'count' for the current user:
<code>Count = wf:session(count)</code>
</p>
</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> wf:session_default(Key, DefaultValue) -&gt; Value. </h3>
<div class="outline-text-3" id="text-7_2">


<p>
Retrieve the session value stored under a specific key. If not
found, return the supplied default value.
</p>
</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3">7.3</span> wf:session(Key, Value) -&gt; ok </h3>
<div class="outline-text-3" id="text-7_3">


<p>
Store a session variable for the current user. Key and Value can be any Erlang term.
For example, store a count:
<code>wf:session(count, Count)</code>
</p>
</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3">7.4</span> wf:clear_session() -&gt; ok </h3>
<div class="outline-text-3" id="text-7_4">


<p>
Clear the current user's session.
</p>
</div>

</div>

<div id="outline-container-7_5" class="outline-3">
<h3 id="sec-7_5"><span class="section-number-3">7.5</span> wf:logout() -&gt; ok </h3>
<div class="outline-text-3" id="text-7_5">

<p>Clear session state, page state, identity, and roles.
</p>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><a name="7" id="7"></a><span class="section-number-2">8</span> Page State </h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> wf:state(Key) -&gt; Value </h3>
<div class="outline-text-3" id="text-8_1">


<p>
Retrieve a page state value stored under the specified key. Page State is
different from Session State in that Page State is scoped to a series
of requests by one user to one Nitrogen Page.
</p>
</div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3">8.2</span> wf:state_default(Key, DefaultValue) -&gt; Value. </h3>
<div class="outline-text-3" id="text-8_2">


<p>
Retrieve a page state value stored under the specified key. If the
value is not set, then return the supplied default value.
</p>
</div>

</div>

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3">8.3</span> wf:state(Key, Value) -&gt; ok </h3>
<div class="outline-text-3" id="text-8_3">


<p>
Store a page state variable for the current user. Page State is
different from Session State in that Page State is scoped to a series
of requests by one user to one Nitrogen Page.
</p>
</div>

</div>

<div id="outline-container-8_4" class="outline-3">
<h3 id="sec-8_4"><span class="section-number-3">8.4</span> wf:clear_state() -&gt; ok </h3>
<div class="outline-text-3" id="text-8_4">

<p>Clear a user's page state.
</p>
</div>
</div>

</div>
