doc/org-mode/api.org
** wf:user() -> User or 'undefined'
   Return the user value that was previously set by =wf:user(User)=

** wf:user(User) -> ok
   Set the user for the current session.
   
** wf:clear\_user() -> ok
   Same as =wf:user(undefined)=.
   
** wf:role(Role) -> 'true' or 'false'
   Check if the current user has a specified role.
   
** wf:role(Role, IsInRole) -> ok
   Set whether the current user is in a specified role.
   
** wf:clear\_roles() -> ok
   Remove the user from all roles.

* Web Request and Response
# <<9>>

** wf:q(AtomKey) -> String

   Get all query string and POST values for the provided key. If more
   than one AtomKey matches, then this will throw an error, use
   =wf:qs(AtomKey)= instead.

** wf:qs(AtomKey) -> [String]

   Get a list of query string and POST values for the provided
   key. (This acts like =wf:q(AtomKey)= in Nitrogen 1.0.)
  
** wf:status\_code(IntegerCode) -> ok
   Set the HTTP response code. Default is 200.
   
** wf:content\_type(ContentType) -> ok

   Set the HTTP content type. Defaults is "text/html". This can be
   used to return text images or other files to the browser, rather than returning 
   HTML.

** wf:path\_info() -> String

   Return the path info for the requested page. In other words, if the module
   web\_my\_page is requsted with the path "/web/my/page/some/extra/stuff then
   wf:get\_path\_info() would return "some/extra/stuff".
   
** wf:page\_module() -> Atom

   Return the requested page module. Useful information to know when writing a custom
   element or action.

* Cookies
# <<10>>

** wf:cookies() -> [{AtomKey, StringValue}].

   Return a proplist of all cookies.

** wf:get\_cookie(Key) -> String

   Get the value of a cookie.

** wf:get\_cookie\_default(Key, Default) -> String.

   Get the value of a cookie, if it doesn't exist, return the default.

** wf:cookie(Key, Value) -> ok

   Tell Nitrogen to set a cookie on the browser. Uses \"/\" for the Path, and Nitrogen's
   session timeout setting for the MinutesToLive value.
   
** wf:cookie(Key, Value, Path, MinutesToLive) -> ok

   Tell Nitrogen to set a cookie on the browser under the specified Path that is valid
   for a certain number of minutes.
   
* HTTP Headers
# <<11>>
   
** wf:headers() -> [{AtomKey, StringValue}, ...]

   Return a proplist of all HTTP headers.
   
** wf:header(AtomKey) -> Value

   Get the value of an HTTP header.

** wf:header\_default(AtomKey, Default) -> Value.
  
   Get the value of an HTTP header, if it doesn't exist, return the default.

** wf:header(StringKey, HeaderValue) -> ok

   Set an HTTP header during the next response.
   
* Serialization
# <<12>>
   
** wf:pickle(Term) -> PickledBinary
   Serialize a term into a web-safe hex string, with checksumming. (Not encrypted!)
   
** wf:depickle(PickledBinary) -> Term
   Turn a pickled binary back into the original term.
   
** wf:depickle(PickledBinary, SecondsToLive) -> Term or 'undefined'

   Turn a pickled binary back into the original term, checking to see
   if the term was pickled more than SecondsToLive second
   ago. Returns the Term if it is still 'fresh' or the atom
   'undefined'.

* Logging
# <<13>>

** wf:info(String)

   Log an informational message.

** wf:info(Format, Args)

   Log an informational message.

** wf:warning(String)

   Log a warning message.

** wf:warning(Format, Args)

   Log a warning message.
  

** wf:error(String)

   Log an error message.

** wf:error(Format, Args)

   Log an error message.

* Configuration
# <<14>>

** wf:config(Key) -> Term
   
   Get the Nitrogen configuration setting under the specified Key.

** wf:config(Key, DefaultValue) -> Term

   Get the Nitrogen configuration setting under the specified Key. If
   not set, then return DefaultValue.

  
