doc/html/api.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><a name="8" id="8"></a><span class="section-number-2">9</span> Authentication and Authorization </h2>
<div class="outline-text-2" id="text-9">



</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> wf:user() -&gt; User or 'undefined' </h3>
<div class="outline-text-3" id="text-9_1">

<p>Return the user value that was previously set by <code>wf:user(User)</code>
</p>
</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3">9.2</span> wf:user(User) -&gt; ok </h3>
<div class="outline-text-3" id="text-9_2">

<p>Set the user for the current session.
</p>
</div>

</div>

<div id="outline-container-9_3" class="outline-3">
<h3 id="sec-9_3"><span class="section-number-3">9.3</span> wf:clear_user() -&gt; ok </h3>
<div class="outline-text-3" id="text-9_3">

<p>Same as <code>wf:user(undefined)</code>.
</p>
</div>

</div>

<div id="outline-container-9_4" class="outline-3">
<h3 id="sec-9_4"><span class="section-number-3">9.4</span> wf:role(Role) -&gt; 'true' or 'false' </h3>
<div class="outline-text-3" id="text-9_4">

<p>Check if the current user has a specified role.
</p>
</div>

</div>

<div id="outline-container-9_5" class="outline-3">
<h3 id="sec-9_5"><span class="section-number-3">9.5</span> wf:role(Role, IsInRole) -&gt; ok </h3>
<div class="outline-text-3" id="text-9_5">

<p>Set whether the current user is in a specified role.
</p>
</div>

</div>

<div id="outline-container-9_6" class="outline-3">
<h3 id="sec-9_6"><span class="section-number-3">9.6</span> wf:clear_roles() -&gt; ok </h3>
<div class="outline-text-3" id="text-9_6">

<p>Remove the user from all roles.
</p>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><a name="9" id="9"></a><span class="section-number-2">10</span> Web Request and Response </h2>
<div class="outline-text-2" id="text-10">



</div>

<div id="outline-container-10_1" class="outline-3">
<h3 id="sec-10_1"><span class="section-number-3">10.1</span> wf:q(AtomKey) -&gt; String </h3>
<div class="outline-text-3" id="text-10_1">


<p>
Get all query string and POST values for the provided key. If more
than one AtomKey matches, then this will throw an error, use
<code>wf:qs(AtomKey)</code> instead.
</p>
</div>

</div>

<div id="outline-container-10_2" class="outline-3">
<h3 id="sec-10_2"><span class="section-number-3">10.2</span> wf:qs(AtomKey) -&gt; [String] </h3>
<div class="outline-text-3" id="text-10_2">


<p>
Get a list of query string and POST values for the provided
key. (This acts like <code>wf:q(AtomKey)</code> in Nitrogen 1.0.)
</p>
</div>

</div>

<div id="outline-container-10_3" class="outline-3">
<h3 id="sec-10_3"><span class="section-number-3">10.3</span> wf:status_code(IntegerCode) -&gt; ok </h3>
<div class="outline-text-3" id="text-10_3">

<p>Set the HTTP response code. Default is 200.
</p>
</div>

</div>

<div id="outline-container-10_4" class="outline-3">
<h3 id="sec-10_4"><span class="section-number-3">10.4</span> wf:content_type(ContentType) -&gt; ok </h3>
<div class="outline-text-3" id="text-10_4">


<p>
Set the HTTP content type. Defaults is "text/html". This can be
used to return text images or other files to the browser, rather than returning 
HTML.
</p>
</div>

</div>

<div id="outline-container-10_5" class="outline-3">
<h3 id="sec-10_5"><span class="section-number-3">10.5</span> wf:path_info() -&gt; String </h3>
<div class="outline-text-3" id="text-10_5">


<p>
Return the path info for the requested page. In other words, if the module
web_my_page is requsted with the path "/web/my/page/some/extra/stuff then
wf:get_path_info() would return "some/extra/stuff".
</p>
</div>

</div>

<div id="outline-container-10_6" class="outline-3">
<h3 id="sec-10_6"><span class="section-number-3">10.6</span> wf:page_module() -&gt; Atom </h3>
<div class="outline-text-3" id="text-10_6">


<p>
Return the requested page module. Useful information to know when writing a custom
element or action.
</p>
</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><a name="10" id="10"></a><span class="section-number-2">11</span> Cookies </h2>
<div class="outline-text-2" id="text-11">



</div>

<div id="outline-container-11_1" class="outline-3">
<h3 id="sec-11_1"><span class="section-number-3">11.1</span> wf:cookies() -&gt; [{AtomKey, StringValue}]. </h3>
<div class="outline-text-3" id="text-11_1">


<p>
Return a proplist of all cookies.
</p>
</div>

</div>

<div id="outline-container-11_2" class="outline-3">
<h3 id="sec-11_2"><span class="section-number-3">11.2</span> wf:get_cookie(Key) -&gt; String </h3>
<div class="outline-text-3" id="text-11_2">


<p>
Get the value of a cookie.
</p>
</div>

</div>

<div id="outline-container-11_3" class="outline-3">
<h3 id="sec-11_3"><span class="section-number-3">11.3</span> wf:get_cookie_default(Key, Default) -&gt; String. </h3>
<div class="outline-text-3" id="text-11_3">


<p>
Get the value of a cookie, if it doesn't exist, return the default.
</p>
</div>

</div>

<div id="outline-container-11_4" class="outline-3">
<h3 id="sec-11_4"><span class="section-number-3">11.4</span> wf:cookie(Key, Value) -&gt; ok </h3>
<div class="outline-text-3" id="text-11_4">


<p>
Tell Nitrogen to set a cookie on the browser. Uses \"/\" for the Path, and Nitrogen's
session timeout setting for the MinutesToLive value.
</p>
</div>

</div>

<div id="outline-container-11_5" class="outline-3">
<h3 id="sec-11_5"><span class="section-number-3">11.5</span> wf:cookie(Key, Value, Path, MinutesToLive) -&gt; ok </h3>
<div class="outline-text-3" id="text-11_5">


<p>
Tell Nitrogen to set a cookie on the browser under the specified Path that is valid
for a certain number of minutes.
</p>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><a name="11" id="11"></a><span class="section-number-2">12</span> HTTP Headers </h2>
<div class="outline-text-2" id="text-12">



</div>

<div id="outline-container-12_1" class="outline-3">
<h3 id="sec-12_1"><span class="section-number-3">12.1</span> wf:headers() -&gt; [{AtomKey, StringValue}, &hellip;] </h3>
<div class="outline-text-3" id="text-12_1">


<p>
Return a proplist of all HTTP headers.
</p>
</div>

</div>

<div id="outline-container-12_2" class="outline-3">
<h3 id="sec-12_2"><span class="section-number-3">12.2</span> wf:header(AtomKey) -&gt; Value </h3>
<div class="outline-text-3" id="text-12_2">


<p>
Get the value of an HTTP header.
</p>
</div>

</div>

<div id="outline-container-12_3" class="outline-3">
<h3 id="sec-12_3"><span class="section-number-3">12.3</span> wf:header_default(AtomKey, Default) -&gt; Value. </h3>
<div class="outline-text-3" id="text-12_3">


<p>
Get the value of an HTTP header, if it doesn't exist, return the default.
</p>
</div>

</div>

<div id="outline-container-12_4" class="outline-3">
<h3 id="sec-12_4"><span class="section-number-3">12.4</span> wf:header(StringKey, HeaderValue) -&gt; ok </h3>
<div class="outline-text-3" id="text-12_4">


<p>
Set an HTTP header during the next response.
</p>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><a name="12" id="12"></a><span class="section-number-2">13</span> Serialization </h2>
<div class="outline-text-2" id="text-13">



</div>

<div id="outline-container-13_1" class="outline-3">
<h3 id="sec-13_1"><span class="section-number-3">13.1</span> wf:pickle(Term) -&gt; PickledBinary </h3>
<div class="outline-text-3" id="text-13_1">

<p>Serialize a term into a web-safe hex string, with checksumming. (Not encrypted!)
</p>
</div>

</div>

<div id="outline-container-13_2" class="outline-3">
<h3 id="sec-13_2"><span class="section-number-3">13.2</span> wf:depickle(PickledBinary) -&gt; Term </h3>
<div class="outline-text-3" id="text-13_2">

<p>Turn a pickled binary back into the original term.
</p>
</div>

</div>

<div id="outline-container-13_3" class="outline-3">
<h3 id="sec-13_3"><span class="section-number-3">13.3</span> wf:depickle(PickledBinary, SecondsToLive) -&gt; Term or 'undefined' </h3>
<div class="outline-text-3" id="text-13_3">


<p>
Turn a pickled binary back into the original term, checking to see
if the term was pickled more than SecondsToLive second
ago. Returns the Term if it is still 'fresh' or the atom
'undefined'.
</p>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><a name="13" id="13"></a><span class="section-number-2">14</span> Logging </h2>
<div class="outline-text-2" id="text-14">



</div>

<div id="outline-container-14_1" class="outline-3">
<h3 id="sec-14_1"><span class="section-number-3">14.1</span> wf:info(String) </h3>
<div class="outline-text-3" id="text-14_1">


<p>
Log an informational message.
</p>
</div>

</div>

<div id="outline-container-14_2" class="outline-3">
<h3 id="sec-14_2"><span class="section-number-3">14.2</span> wf:info(Format, Args) </h3>
<div class="outline-text-3" id="text-14_2">


<p>
Log an informational message.
</p>
</div>

</div>

<div id="outline-container-14_3" class="outline-3">
<h3 id="sec-14_3"><span class="section-number-3">14.3</span> wf:warning(String) </h3>
<div class="outline-text-3" id="text-14_3">


<p>
Log a warning message.
</p>
</div>

</div>

<div id="outline-container-14_4" class="outline-3">
<h3 id="sec-14_4"><span class="section-number-3">14.4</span> wf:warning(Format, Args) </h3>
<div class="outline-text-3" id="text-14_4">


<p>
Log a warning message.
</p>

</div>

</div>

<div id="outline-container-14_5" class="outline-3">
<h3 id="sec-14_5"><span class="section-number-3">14.5</span> wf:error(String) </h3>
<div class="outline-text-3" id="text-14_5">


<p>
Log an error message.
</p>
</div>

</div>

<div id="outline-container-14_6" class="outline-3">
<h3 id="sec-14_6"><span class="section-number-3">14.6</span> wf:error(Format, Args) </h3>
<div class="outline-text-3" id="text-14_6">


<p>
Log an error message.
</p>
</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><a name="14" id="14"></a><span class="section-number-2">15</span> Configuration </h2>
<div class="outline-text-2" id="text-15">



</div>

<div id="outline-container-15_1" class="outline-3">
<h3 id="sec-15_1"><span class="section-number-3">15.1</span> wf:config(Key) -&gt; Term </h3>
<div class="outline-text-3" id="text-15_1">


<p>
Get the Nitrogen configuration setting under the specified Key.
</p>
</div>

</div>

<div id="outline-container-15_2" class="outline-3">
<h3 id="sec-15_2"><span class="section-number-3">15.2</span> wf:config(Key, DefaultValue) -&gt; Term </h3>
<div class="outline-text-3" id="text-15_2">


<p>
Get the Nitrogen configuration setting under the specified Key. If
not set, then return DefaultValue.
</p>

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus (@rklophaus)
</p>
<p class="date"> Date: 2010-12-20 17:14:34 EST</p>
<p class="creator">HTML generated by org-mode 7.01h in emacs 24</p>
</div>
</div>
</body>
</html>
